package main

/**
120. 三角形最小路径和

给定一个三角形，找出自顶向下的最小路径和。每一步只能移动到下一行中相邻的结点上。
相邻的结点 在这里指的是 下标 与 上一层结点下标 相同或者等于 上一层结点下标 + 1 的两个结点。

例如，给定三角形：
```
[
     [2],
    [3,4],
   [6,5,7],
  [4,1,8,3]
]
```
自顶向下的最小路径和为 11（即，2 + 3 + 5 + 1 = 11）。

说明：
如果你可以只使用 O(n) 的额外空间（n 为三角形的总行数）来解决这个问题，那么你的算法会很加分。
*/

/**
今天这道题好像以前做过了，有了思路就简单很多
*/
func MinimumTotal(tri [][]int) int {
	for i := len(tri) - 2; i >= 0; i-- {
		for j := len(tri[i]) - 1; j >= 0; j-- {
			tri[i][j] = tri[i][j] + min(tri[i+1][j], tri[i+1][j+1])
		}
	}
	return tri[0][0]
}

func min(a, b int) int {
	if a > b {
		return b
	}
	return a
}
